Documents/ОприходованиеОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОприходованиеОС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>InformationRegister.ПринятыеКУчетуОС</xr:Item>
				<xr:Item>AccumulationRegister.АК_ОсновныеСредстваКСписаниюОприходованию</xr:Item>
				<xr:Item>InformationRegister.СостояниеОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗабалансовый</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АК_СуммаАмортизации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизационнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвентарь</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АК_ДатаВводаВЭксплуатацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦФОСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦФОСтруктурныхЕдиниц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторИзменений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводВЭксплуатацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВводВЭксплуатацию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьАК_НачислениеАмортизации</xr:Item>
				<xr:Item>InformationRegister.ПринятыеКУчетуОС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноТекстЗапросаВнешний</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийВводВЭксплуатацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВвода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокПолезногоИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АмортизационнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвентарныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписываетсяВМоментВвода</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Местоположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаАмортизации</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПринятияКУчету</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНМА</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНМА</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОприходованиеОС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьЦФОПоТТ(мТорговаяТочка, мДата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТТ"	, мТорговаяТочка);
	Запрос.УстановитьПараметр("Дата", мДата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦФОСтруктурныхЕдиницСрезПоследних.ЦФО
	|ИЗ
	|	РегистрСведений.ЦФОСтруктурныхЕдиниц.СрезПоследних(&Дата, СтруктурнаяЕдиница = &ТТ) КАК ЦФОСтруктурныхЕдиницСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЦФО;
	Иначе
		Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСчетУчетаОС(мОсновноеСредство, мДата)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОсновноеСредство", мОсновноеСредство);
	Запрос.УстановитьПараметр("Дата"			, мДата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФинансовыйОстатки.Счет
	|ИЗ
	|	РегистрБухгалтерии.Финансовый.Остатки(&Дата, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Финансовый.ОсновныеСредства)), , Субконто3 = &ОсновноеСредство) КАК ФинансовыйОстатки";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Счет;
	Иначе
		Возврат ПланыСчетов.Финансовый.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуЗакрытияТТ(мСклад)
	
	Возврат мСклад.ДатаЗакрытия;
	
КонецФункции

Процедура УстановитьВидимость()
	
	Если ТипЗнч(Объект.Склад) = Тип("СправочникСсылка.СтруктурныеЕдиницы")
			И ЗначениеЗаполнено(Объект.Склад) Тогда
		мДатазакрытия = ПолучитьДатуЗакрытияТТ(Объект.Склад);
		Если ЗначениеЗаполнено(мДатаЗакрытия)
				И мДатаЗакрытия < Объект.Дата Тогда
			Элементы.Склад.ЦветФона = Новый Цвет(222, 222, 222);
		Иначе
			Элементы.Склад.ЦветФона = Новый Цвет(255, 255, 255);
		КонецЕсли;
	Иначе
		Элементы.Склад.ЦветФона = Новый Цвет(255, 255, 255);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НастройкаПравДоступа.ОпределитьДоступностьВозможностьИзмененияДокументаПоДатеЗапрета(Объект.Ссылка.ПолучитьОбъект(), ЭтаФорма);
	КонецЕсли;	

	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли;
	
	УстановитьВариант();
	ЗаполнитьРеквизитыОС();
	
КонецПроцедуры

Процедура УстановитьВариант();

	МСФО = АК_ОсновныеСредства.УчетМСФО(Объект.Дата);
	
	УсловноеОформление();	
	
КонецПроцедуры	

Процедура УсловноеОформление()
	
	Элементы.ГруппаВариантНовый.Видимость = МСФО;		
	Элементы.ГруппаВариантСтарый.Видимость = Не МСФО;
	
	Элементы.СчетУчета.Видимость = не МСФО;
	Элементы.Основание.Видимость = МСФО;
	//Элементы.ОсновныеСредстваПерезаполнитьПоИнвентаризации.Видимость = МСФО;	
	
	Если Не МСФО Тогда
		УстановитьВидимость();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Склад) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		мДата = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
		Объект.ЦФО = ПолучитьЦФОПоТТ(Объект.Склад, мДата);
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьОСПоИнвентарномуНомеру(мИнвентарныйНомер)
	
	Возврат Справочники.ОсновныеСредства.НайтиПоРеквизиту("ИнвентарныйНомер", мИнвентарныйНомер);
	
КонецФункции

&НаКлиенте
Процедура Подбор(Команда)
	
	Перем мИнвентарныйНомер;
	
	Если ВвестиЗначение(мИнвентарныйНомер, "Укажите инвентарный номер", Новый ОписаниеТипов("Строка")) Тогда
		ТекОС = ПолучитьОСПоИнвентарномуНомеру(мИнвентарныйНомер);
		Если НЕ ТекОС.Пустая() Тогда
			НоваяСтрока = Объект.Номенклатура.Добавить();
			НоваяСтрока.ОсновноеСредство = ПолучитьОСПоИнвентарномуНомеру(мИнвентарныйНомер);
	
			мДата = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
			пСчетУчета = ПолучитьСчетУчетаОС(НоваяСтрока.ОсновноеСредство, мДата);
			Если ЗначениеЗаполнено(пСчетУчета) Тогда
				НоваяСтрока.СчетУчета = пСчетУчета;
			КонецЕсли;
		Иначе
			Сообщить("Не найдено основное средство с указанным инв. номером!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//+++AK susk

&НаСервере
Функция ПолучитьСуммуДокументаСервер()
	
	// Возврат Объект.Номенклатура.Итог("Сумма");
	Возврат ОБъект.Номенклатура.Итог("Сумма") + Объект.Номенклатура.Итог("АК_СуммаАмортизации");

КонецФункции

//---AK susk

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Объект.СуммаДокумента = ПолучитьСуммуДокументаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		НоваяСтрока = Объект.Номенклатура.Добавить();
		НоваяСтрока.ОсновноеСредство 		= ВыбранноеЗначение;
		мДата = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
		НоваяСтрока.СчетУчетаЗабалансовый 	= ПолучитьСчетУчетаОС(ВыбранноеЗначение, мДата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОсновноеСредствоПриИзменении(Элемент)
	
	ТекДанные = Элементы.ОсновныеСредства.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мДата = ?(НЕ ЗначениеЗаполнено(Объект.Ссылка), ТекущаяДата(), Объект.Дата);
	пСчетУчета = ПолучитьСчетУчетаОС(ТекДанные.ОсновноеСредство, мДата);
	Если ЗначениеЗаполнено(пСчетУчета) Тогда
		ТекДанные.СчетУчета = пСчетУчета;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСрокИГруппу(Команда)
	
	УстановитьСрокИГруппуНачало();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСрокИГруппуНачало()

	Результат = ОткрытьФормуМодально("Документ.ВводВЭксплуатацию.Форма.ФормаЗаполненияТЧ");		
	
	Если Результат = Неопределено Тогда
		возврат;
	КонецЕсли;
	
	Если Результат.РежимЗаполнения = "Не заполненные" Тогда
		
		Для каждого СтрокаТЧ из Объект.Номенклатура Цикл
			
			Если НЕ ЗначениеЗаполнено(СтрокаТЧ.СрокПолезногоИспользования) Тогда
				СтрокаТЧ.СрокПолезногоИспользования = Результат.СрокПолезногоИспользования;	
			КонецЕсли;
			
			АК_ОсновныеСредства.УстановитьРеквизитыОС(СтрокаТЧ.ОсновноеСредство,Результат,Ложь);
 			
		КонецЦикла;			
		
	КонецЕсли;	
	
	Если Результат.РежимЗаполнения = "Все" Тогда
		
		Для каждого СтрокаТЧ из Объект.Номенклатура Цикл
			
			СтрокаТЧ.СрокПолезногоИспользования = Результат.СрокПолезногоИспользования;				
			АК_ОсновныеСредства.УстановитьРеквизитыОС(СтрокаТЧ.ОсновноеСредство,Результат,Истина);
 			
		КонецЦикла;			
		
	КонецЕсли;
	
	Если Результат.РежимЗаполнения = "Выделенные" Тогда
		
		Для каждого Строка из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
			
			СтрокаТЧ = Элементы.ОсновныеСредства.ДанныеСтроки(Строка);
			АК_ОсновныеСредства.УстановитьРеквизитыОС(СтрокаТЧ.ОсновноеСредство,Результат,Истина);
			СтрокаТЧ.СрокПолезногоИспользования = Результат.СрокПолезногоИспользования;
			
		КонецЦикла;			
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыОС();
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыОС()

	Для каждого СтрокаОС из Объект.Номенклатура Цикл
		
		ЗаполнитьРеквизитыОСВСтроке(СтрокаОС);	
		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыОСВСтроке(СтрокаОС)
	
	Если ЗначениеЗаполнено(СтрокаОС.ОсновноеСредство) Тогда
			
		СтрокаОС.АмортизационнаяГруппаОС = СтрокаОС.ОсновноеСредство.АмортизационнаяГруппа;
		СтрокаОС.ГруппаОС                = СтрокаОС.ОсновноеСредство.ГруппаОС;
		СтрокаОС.КодПоОКОФ               = СтрокаОС.ОсновноеСредство.КодПоОКОФ;
			
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОсновныеСредстваВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Врег(Поле.Имя) =  Врег("ОсновныеСредстваАмортизационнаяГруппаОС") ИЛИ
			Врег(Поле.Имя) =  Врег("ОсновныеСредстваСрокПолезногоИспользования") ИЛИ
			Врег(Поле.Имя) =  Врег("ОсновныеСредстваГруппаОС") ИЛИ
			Врег(Поле.Имя) =  Врег("ОсновныеСредстваКодПоОКОФ") Тогда
			
			
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ВыбранноеПоле",Врег(Поле.Имя)); 
			
		ОткрытьРедактированиеОС(ПараметрыОткрытия);
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедактированиеОС(ПараметрыОткрытия)
	
  	ВыбраннаяСтрока = Элементы.ОсновныеСредства.ТекущиеДанные;
	
	Если  Элементы.ОсновныеСредства.ВыделенныеСтроки.Количество() = 1 Тогда	
		ПараметрыОткрытия.Вставить("АмортизационнаяГруппа",ВыбраннаяСтрока.ОсновноеСредство.АмортизационнаяГруппа);
		ПараметрыОткрытия.Вставить("ГруппаОС",ВыбраннаяСтрока.ОсновноеСредство.ГруппаОС);
		ПараметрыОткрытия.Вставить("КодПоОКОФ",ВыбраннаяСтрока.ОсновноеСредство.КодПоОКОФ);
		ПараметрыОткрытия.Вставить("СрокПолезногоИспользования",ВыбраннаяСтрока.СрокПолезногоИспользования);	
	Иначе 	
		ПараметрыОткрытия.Вставить("АмортизационнаяГруппа",Перечисления.АмортизационныеГруппы.ПустаяСсылка());
		ПараметрыОткрытия.Вставить("ГруппаОС",Перечисления.ГруппыОС.ПустаяСсылка());
		ПараметрыОткрытия.Вставить("КодПоОКОФ",Справочники.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка());
		ПараметрыОткрытия.Вставить("СрокПолезногоИспользования",0);	
	КонецЕсли;	
		
	ПараметрыОткрытия.Вставить("ПоказыватьРежим",Ложь);
	
	Результат = ОткрытьФормуМодально("Документ.ВводВЭксплуатацию.Форма.ФормаЗаполненияТЧ",ПараметрыОткрытия);	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура;
	
	Если ПараметрыОткрытия.ВыбранноеПоле =  Врег("ОсновныеСредстваАмортизационнаяГруппаОС") Тогда 
		СтруктураЗаполнения.Вставить("АмортизационнаяГруппа",Результат.АмортизационнаяГруппа)			
	КонецЕсли;	
		
	Если ПараметрыОткрытия.ВыбранноеПоле =  Врег("ОсновныеСредстваГруппаОС") Тогда 
		СтруктураЗаполнения.Вставить("ГруппаОС",Результат.ГруппаОС)			
	КонецЕсли;	
	
	Если ПараметрыОткрытия.ВыбранноеПоле =  Врег("ОсновныеСредстваКодПоОКОФ") Тогда 
		СтруктураЗаполнения.Вставить("КодПоОКОФ",Результат.КодПоОКОФ)			
	КонецЕсли;	
	
	Для каждого Строка из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
		СтрокаТЧ = Элементы.ОсновныеСредства.ДанныеСтроки(Строка);
		АК_ОсновныеСредства.УстановитьРеквизитыОС(СтрокаТЧ.ОсновноеСредство,СтруктураЗаполнения,Истина);
	КонецЦикла;
	
	Если ПараметрыОткрытия.ВыбранноеПоле =  Врег("ОсновныеСредстваСрокПолезногоИспользования") Тогда 
		Для каждого Строка из Элементы.ОсновныеСредства.ВыделенныеСтроки Цикл
			СтрокаТЧ = Элементы.ОсновныеСредства.ДанныеСтроки(Строка);
			СтрокаТЧ.СрокПолезногоИспользования = Результат.СрокПолезногоИспользования;
		КонецЦикла;	
	КонецЕсли;		
	
	ЗаполнитьРеквизитыОС();
	
КонецПроцедуры




&НаКлиенте
Процедура ПерезаполнитьПоИнвентаризации(Команда)
	
	Если Объект.Проведен Тогда		
		Сообщить("Нельзя перезаполнять проведенный документ. Отмените проведение для перезаполнения");		
	Иначе		
		ПерезаполнитьПоИнвентаризацииНаСервере();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоИнвентаризацииНаСервере()

	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьОСПоИнвентаризацииМСФО();
	ЗначениеВРеквизитФормы(ДокументОбъект,"Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьРеквизитыОС();
	Оповестить("СкладскиеАкты_ПослеЗаписи");
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчетУчета(Команда)
	
	УстановитьСчет(ПредопределенноеЗначение("ПланСчетов.Финансовый.ОсновныеСредстваВОрганизации"));

КонецПроцедуры

&НаКлиенте
Процедура УстановитьСчет0110до100(Команда)
	
	УстановитьСчет(ПредопределенноеЗначение("ПланСчетов.Финансовый.ОсновныеСредстваДо100000"),Истина);
	
КонецПроцедуры

Процедура УстановитьСчет(Счет,ОтборПоСтоимости = Ложь)
	
	Для Каждого СтрокаОС из Объект.Номенклатура Цикл
		
		Если ОтборПоСтоимости и СтрокаОС.Сумма > 100000 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОС.СчетУчетаЗабалансовый = Счет;
				
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьСчет0110(Команда)
	
	УстановитьСчет(ПредопределенноеЗначение("ПланСчетов.Финансовый.ОсновныеСредстваДо100000"));

КонецПроцедуры
